import pandas as pd
df = pd.read_excel('movies.xlsx')
print(df)
# найти все фильмы жанра драма
df2 = df[df['Жанр']=='драма'].sort_values(by='Рейтинг',ascending=False)
print('*****************************************************************************')
print('Фильмы Драма')
print('*****************************************************************************')
print(df2)
# найти все фильмы Стивена Спилберга
df3 = df[df['Режиссер']=='Стивен Спилберг'].sort_values(by='Рейтинг',ascending=False)
print('*****************************************************************************')
print('Фильмы Стивена Спилберга')
print('*****************************************************************************')
print(df3)
# найти фильм с максимальным рейтингом
max_rait = df['Рейтинг'].max()
df4 = df[df['Рейтинг']==max_rait]
print('*****************************************************************************')
print('Фильмы с максимальным рейтингом')
print('*****************************************************************************')
print(df4)
# найти фильмы начиная с 2005 года
df5 = df[df['Год']>=2005].sort_values(by='Год',ascending=True)
print('*****************************************************************************')
print('Фильмы с 2005 года')
print('*****************************************************************************')
print(df5)
